function [aerody, dds, hingle] = init_aerody()
%% 气动库
aerody = read_aerody_database('database/L400气动力数据库.V2a.20250721.txt');

% 气动力系数参考面积为11.1m2，纵向参考长度bA=1m，横航向参考长度L=11.5m，力矩参考点（2.1876m，0m，0.1386m）。
aerody.Sref = 11.1;
aerody.Cref = 1;
aerody.Bref = 11.5;

% 参考长度
aerody.Lref = [aerody.Bref,aerody.Cref, aerody.Bref];

% 构型坐标系，后右上为正
aerody.COP = [2.308,0,-0.065];

%% 动导数
% dds = read_aerody_database('database/L400动导数数据库.V2.20250711.txt');
dds.VALPHA =[  -6  -4  -2   0   2   4   6   8  10  12  14];
dds.CMQ =[  -10.6722  -10.8995  -10.8140  -10.6568  -10.8855  -10.9193  -10.9817  -11.6738  -13.0704  -14.4727  -15.0686];
dds.CNR =[  -0.0430   -0.0481   -0.0481   -0.0432   -0.0419   -0.0423   -0.0429   -0.0437   -0.0455   -0.0479   -0.0518];
dds.CRP =[  -0.7227   -0.7239   -0.7217   -0.7126   -0.6977   -0.6754   -0.6396   -0.5701   -0.4388   -0.3035   -0.2539];
dds.CNP =[  0.0284    0.0105   -0.0293   -0.0707   -0.1100   -0.1470   -0.1803   -0.2036   -0.2004   -0.1767   -0.1634];
dds.CRR =[  0.0152    0.0178    0.0181    0.0163    0.0159    0.0162    0.0164    0.0166    0.0169    0.0172    0.0191];

%% 铰链力矩
hingle = read_aerody_database('database/L400铰链力矩系数数据库.V2.20250707.txt');
